src/cf/InformationRegisters/ПодразделенияТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ПодразделенияТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьБрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПодразделенияТорговыхТочек/Ext/ManagerModule.bsl
// +++ VOG Кулаков П.Л. 26.03.2021
Функция ПолучитьПодразделениеТорговойТочки(ТорговаяТочка, НаправлениеДеятельности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияТорговыхТочек.ТорговаяТочка КАК ТорговаяТочка,
		|	ПодразделенияТорговыхТочек.Направление КАК Направление,
		|	ПодразделенияТорговыхТочек.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ПодразделенияТорговыхТочек КАК ПодразделенияТорговыхТочек
		|ГДЕ
		|	ПодразделенияТорговыхТочек.ТорговаяТочка = &ТорговаяТочка
		|	И ПодразделенияТорговыхТочек.Направление = &Направление
		|	И (ПодразделенияТорговыхТочек.ЕстьБрендМенеджер
		|				И НЕ ПодразделенияТорговыхТочек.БрендМенеджер
		|			ИЛИ НЕ ПодразделенияТорговыхТочек.ЕстьБрендМенеджер
		|				И НЕ ПодразделенияТорговыхТочек.БрендМенеджер)";
	
	Запрос.УстановитьПараметр("Направление", НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Подразделение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // --- VOG Кулаков П.Л.
